{"headline":"'Insidious tactics' — Mass Russian missile and drone strike kills at least 4, injures 68 in Kyiv, its surrounding region, Zaporizhzhia - The Kyiv Independent"}
{"headline":"Interstellar Object 3I\/ATLAS Appeared To Turn From Red To Green. Why? - IFLScience"}
{"headline":"Ducks' Moore breaks through in 2OT upset of PSU - ESPN"}
{"headline":"'Meet the Putmans' family says 3 members killed in Michigan car crash, 5 injured - New York Post"}
{"headline":"Autism may be the price of human intelligence - ScienceDaily"}
{"headline":"Stampede at a political rally for popular actor Vijay in southern India kills 36, injures 40 - AP News"}
{"headline":"UFC Perth results: Carlos Ulberg destroys Dominick Reyes with ferocious KO, punches likely title shot ticket - Yahoo Sports"}
{"headline":"Horoscope for Sunday, September 28, 2025 - Chicago Sun-Times"}
{"headline":"3 dead, 8 injured after shooter in boat opens fire on North Carolina waterfront bar: Official - ABC News - Breaking News, Latest News and Videos"}
{"headline":"Vikings vs Steelers Prediction, Pick, Odds for NFL Week 4 - Action Network"}
{"headline":"Autism community says Trump announcement a \"mind game\" - BBC"}
{"headline":"How protests outside Portland ICE unfolded before Trump’s troop announcement - OregonLive.com"}
{"headline":"Iran warned not to escalate after UK, Germany and France impose sanctions - BBC"}
{"headline":"Trump to meet with congressional leaders ahead of shutdown deadline - CBS News"}
{"headline":"Officials place Des Moines schools leader on leave after his arrest by immigration agents - AP News"}
{"headline":"Selena Gomez and Benny Blanco Are Married! See the First Photos Here - Vogue"}
{"headline":"Arizona flooding kills 4, causes 1,000 propane tanks to wash away in hazmat concern - ABC News - Breaking News, Latest News and Videos"}
{"headline":"Hurricane Humberto has rapidly intensified into Category 5 hurricane - WFTV"}
{"headline":"Airstrikes and gunfire kill at least 59 people in Gaza as pressure grows for ceasefire, hostage deal - AP News"}
{"headline":"Nightmare Bacteria, Superbugs On The Rise In California - Patch"}
